workspace/DataProcessors/АукРабочийСтолАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>АукРабочийСтолАукционы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

workspace/Catalogs/АукВидыАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукВидыАукционов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыОперацийАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукПродуктыАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СРаспределениемСуммы</Name>
					<Comment>Признак того, что при подведении итогов по аукциону данного вида будет использоваться распределение суммы аукциона</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоЗначенийСтруктурыСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоЗначенийСтруктурыВводныхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточныйИтогВариантВыбора</Name>
					<Comment>0 - Минимум, 1 - Максимум</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточныйИтогФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточныйИтогШаблонРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательныйИтогФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательныйИтогРаспределяемаяСуммаОсновная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательныйИтогРаспределяемаяСуммаДополнительная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаРасчетаПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукНастройкиРасчетовИтогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаРасчетаОкончательныхИтогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукНастройкиРасчетовИтогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураСтавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементСтавки</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОбязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураНачальныхДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПоУмолчанию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЧасы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/DataProcessors/АукРабочийСтолАукционы/Forms/ВводСтавкиУчастника/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.Обработка_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.Обработка_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого ЭлМас Из ЭтотОбъект.РеквизитыСПроверкойЗаполнения Цикл
		ПроверяемыеРеквизиты.Добавить(ЭлМас);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.Обработка_ПриОткрытии(ЭтотОбъект, Отказ);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьИнтерфейс();
	
	СоздатьПервуюСтроку();
	
	ПодпискиНаСобытияФормКлиент.Обработка_ПослеОткрытия(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокЗначенийСтавкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		НовСтрока = ЭтотОбъект.СписокЗначенийСтавки.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		
		Для Каждого ЭлСоо Из ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами Цикл
			НовСтрока["Характеристика" + ЭлСоо.Ключ] = ЭлСоо.Значение;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийСтавкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Не ЭтотОбъект.НесколькоЗначенийСтруктурыСтавки;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийСтавкиПередУдалением(Элемент, Отказ)
	
	Отказ = Не ЭтотОбъект.НесколькоЗначенийСтруктурыСтавки;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	АукОбщийКлиент.НачатьВыборУчастника(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	АукОбщийКлиент.НачатьВыборКонтактногоЛица(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникОчистка(Элемент, СтандартнаяОбработка)
	
	ЭтотОбъект.КонтактноеЛицо = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникПриИзменении(Элемент)

	АукОбщийКлиент.УчастникПриИзменении(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Принять(Команда)
	ЗафиксироватьИнформациюОтУчастников();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьПервуюСтроку() 
	
	НовСтрока = ЭтотОбъект.СписокЗначенийСтавки.Добавить();
	
	Для Каждого ЭлСоо Из ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами Цикл
		НовСтрока["Характеристика" + ЭлСоо.Ключ] = ЭлСоо.Значение;	
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗафиксироватьИнформациюОтУчастников()
	
	Если ПроверитьЗаполнение() Тогда
		
		Закрыть(ДанныеСтавкиИзДанныхФормы());
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеСтавкиИзДанныхФормы()
	
	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Аукцион",		ЭтотОбъект.Аукцион);
	сткРезультат.Вставить("Участник",		ЭтотОбъект.Участник);
	сткРезультат.Вставить("КонтактноеЛицо",	ЭтотОбъект.КонтактноеЛицо);
	
	масРеквизитыСтавки = АукОбщийКлиентСервер.КлючиКоллекцииВМассив(ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами);
	сткРезультат.Вставить("Данные",	АукОбщийКлиент.ДанныеСтавкиВМассивСтруктур(ЭтотОбъект.СписокЗначенийСтавки, масРеквизитыСтавки));
	
	Возврат сткРезультат;
	
КонецФункции	

&НаКлиенте
Процедура НастроитьИнтерфейс()
	
	Элементы.СписокЗначенийСтавки.КоманднаяПанель.Видимость = ЭтотОбъект.НесколькоЗначенийСтруктурыСтавки;
	//Элементы.СписокЗначенийСтавки.КоманднаяПанель.ПодчиненныеЭлементы.СписокЗначенийСтавкиПереместить.Видимость = ЭтотОбъект.НесколькоЗначенийСтруктурыСтавки;
		
КонецПроцедуры

&НаСервере
Процедура НачальнаяИнициализация()
	
	ЭтотОбъект.Аукцион	= Параметры.Аукцион;
	
	АукОбщийСервер.ЗаполнитьДанныеДляОтборовНаФорме(ЭтотОбъект);
	
	АукОбщийСервер.ДобавитьКолонкиДанныхСтавкиПоВидуАукциона(ЭтотОбъект, Параметры.ВидАукциона, "СписокЗначенийСтавки");
	
	ЗаполнитьДляПроверкиЗаполнения();
		
	ЭтотОбъект.НесколькоЗначенийСтруктурыСтавки	= Справочники.АукВидыАукционов.ОписаниеНастроекСтавокПоВидуАукциона(Параметры.ВидАукциона).НесколькоЗначенийСтруктурыСтавки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДляПроверкиЗаполнения()
	
	масСтруктураСтавки = Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(Параметры.ВидАукциона);
	
	сооСвязьЭлементовСтавкиСРеквизитами = Новый Соответствие;
	масРеквизитыСПроверкойЗаполнения = Новый Массив;
	
	Для Каждого сткЭлемент Из масСтруктураСтавки Цикл
		сооСвязьЭлементовСтавкиСРеквизитами.Вставить(сткЭлемент.ТехническоеНаименование, сткЭлемент.Элемент);
		
		Если Не сткЭлемент.НеОбязательный Тогда
			масРеквизитыСПроверкойЗаполнения.Добавить("СписокЗначенийСтавки." + сткЭлемент.ТехническоеНаименование);
		КонецЕсли;
	КонецЦикла;
	
	ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами = Новый ФиксированноеСоответствие(сооСвязьЭлементовСтавкиСРеквизитами);
	
	ЭтотОбъект.РеквизитыСПроверкойЗаполнения	= Новый ФиксированныйМассив(масРеквизитыСПроверкойЗаполнения);
		
КонецПроцедуры

#КонецОбласти
